app/src/main/res/raw/soap_ex.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <ExecuteSQL xmlns="http://railway.gtwise.com">
            <sSql>$Sql</sSql>
            <sAuthInfo>$authInfo</sAuthInfo>
            <sSessionKey>$sessionKey</sSessionKey>
        </ExecuteSQL>
    </soap:Body>
</soap:Envelope>
